In [1]:
import pandas as pd

In [8]:
file_path = 'Resources/iris.csv'
iris_df = pd.read_csv(file_path)
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [9]:
new_iris_df = iris_df.drop(['class'], axis=1)
new_iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [10]:
new_iris_df = new_iris_df[['sepal_length', 'petal_length', 'sepal_width', 'petal_width']]
new_iris_df.head()

   sepal_length  petal_length  sepal_width  petal_width
0           5.1           1.4          3.5          0.2
1           4.9           1.4          3.0          0.2
2           4.7           1.3          3.2          0.2
3           4.6           1.5          3.1          0.2
4           5.0           1.4          3.6          0.2

In [13]:
output_file_path = 'Resources/new_iris_data.csv'
new_iris_df.to_csv(output_file_path, index=False)

In [15]:
file_path = 'Resources/shopping_data.csv'
shopping_df = pd.read_csv(file_path, encoding='ISO-8859-1')
shopping_df.head(5)

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [16]:
shopping_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [17]:
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [21]:
# counting null values in each column
for column in shopping_df.columns:
    print(f"'{column}' column has {shopping_df[column].isnull().sum()} null value(s)")

'CustomerID' column has 0 null value(s)
'Card Member' column has 2 null value(s)
'Age' column has 2 null value(s)
'Annual Income' column has 0 null value(s)
'Spending Score (1-100)' column has 1 null value(s)

In [22]:
# drop null rows
shopping_df = shopping_df.dropna()

In [24]:
# check for duplicate entries
print(f"Duplicate entries: {shopping_df.duplicated().sum()}")

Duplicate entries: 0

In [26]:
# remove CustomerID column
shopping_df.drop(columns=['CustomerID'], inplace=True)
shopping_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [27]:
# transform 'yes' into 1 and everything else to 0
def change_string(member):
    if member == 'Yes':
        return 1
    else:
        return 0

shopping_df['Card Member'] = shopping_df['Card Member'].apply(change_string)
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [28]:
# scale the income column by 1000
shopping_df['Annual Income'] = shopping_df['Annual Income'] /1000
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [30]:
# rename columns
shopping_df = shopping_df.rename(columns={'Card Member': 'card_member',
                           'Age': 'age',
                           'Annual Income': 'annual_income',
                           'Spending Score (1-100)': 'spending_score'})
shopping_df.head()

   card_member   age  annual_income  spending_score
0            1  19.0           15.0            39.0
1            1  21.0           15.0            81.0
2            0  20.0           16.0             6.0
3            0  23.0           16.0            77.0
4            0  31.0           17.0            40.0

In [31]:
output_file_path = 'Resources/shopping_data_cleaned.csv'
shopping_df.to_csv(output_file_path, index=False)